# YOLOv5 🚀 by Ultralytics, GPL-3.0 license

# Parameters
nc: 2  # number of classes
depth_multiple: 0.33  # model depth multiple
width_multiple: 0.50  # layer channel multiple
anchors:
  - [4,5, 8,10, 22,18] # P2/4
  - [10,13, 16,30, 33,23]  # P3/8
  - [30,61, 62,45, 59,119]  # P4/16
  - [116,90, 156,198, 373,326]  # P5/32

# YOLOv5 v6.0 backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, Conv, [64, 6, 2, 2]],  # 0-P1/2
   [-1, 1, Conv, [128, 3, 2]],    # 1-P2/4
   [-1, 3, C3, [128]],
   [-1, 3, SimAM, [128]],  # 3
   [-1, 1, Conv, [256, 3, 2]],  # 4-P3/8
   [-1, 6, C3, [256]],     # 5
   [-1, 3, SimAM, [256]],  # 6
   [-1, 1, Conv, [512, 3, 2]],  # 7-P4/16
   [-1, 9, C3, [512]],     # 8
   [-1, 3, SimAM, [512]],  # 9
   [-1, 1, Conv, [1024, 3, 2]],  # 10-P5/32
   [-1, 3, C3, [1024]],
   [-1, 3, SimAM, [1024]],    # 12
   [-1, 1, SPPF, [1024, 5]],  # 13
  ]

# YOLOv5 v6.0 head
head:
  [[-1, 1, Conv, [512, 1, 1]],      # 14
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 8], 1, Concat, [1]],  # 16 cat backbone P4
   [-1, 3, C3, [512, False]],  # 17

   [-1, 1, Conv, [256, 1, 1]],   # 18
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],  # 19
   [[-1, 5], 1, Concat, [1]],  # cat backbone P3  20

   # add feature extration layer
   [-1, 3, C3, [256, False]],  # 21
   [-1, 1, Conv, [128, 1, 1]], # 22
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],  # 23
   [[-1, 2], 1, Concat, [1]],  # cat backbone P3 24

   # add detect layer
   [-1, 3, C3, [128, False]],  # 25 (P4/4-minium)

   [-1, 1, Conv, [128, 3, 2]], # 26
   [[-1, 22], 1, Concat, [1]],  # cat head P3
   # end

   [-1, 3, C3, [256, False]],  # 28 (P3/8-small)

   [-1, 1, Conv, [256, 3, 2]],  # 29
   [[-1, 18], 1, Concat, [1]],  # cat head P4
   [-1, 3, C3, [512, False]],  # 31 (P4/16-medium)

   [-1, 1, Conv, [512, 3, 2]],  # 32
   [[-1, 14], 1, Concat, [1]],  # cat head P5
   [-1, 3, C3, [1024, False]],  # 34 (P5/32-large)

   [[25, 28, 31, 34], 1, Detect, [nc, anchors]],  # Detect(P2, P3, P4, P5)
  ]

